In [1]:
import pandas as pd
import numpy as np

In [2]:
labels = ['a', 'b', 'c']
my_data = [10, 20, 30]
arr = np.array(my_data)
d = {'a':10, 'b':20, 'c':30}

In [3]:
di = dict(zip(labels, my_data))

In [4]:
di

{'a': 10, 'b': 20, 'c': 30}

In [5]:
pd.Series(data=my_data)

0    10
1    20
2    30
dtype: int64

In [6]:
pd.Series(data=my_data, index=labels)

a    10
b    20
c    30
dtype: int64

In [7]:
pd.Series(my_data, labels)

a    10
b    20
c    30
dtype: int64

In [9]:
pd.Series(arr, labels)

a    10
b    20
c    30
dtype: int64

In [10]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [13]:
pd.Series(data=labels, index=my_data)

10    a
20    b
30    c
dtype: object

In [14]:
ser1 = pd.Series([1,2,3,4], ['USA', 'Germany', 'USSR', 'Japan'])

In [15]:
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [16]:
ser2 = pd.Series([1,2,5,4], ['USA', 'Germany', 'Italy', 'Japan'])

In [17]:
ser2

USA        1
Germany    2
Italy      5
Japan      4
dtype: int64

In [18]:
ser1['USA']

1

In [19]:
ser3 = pd.Series(data=labels)

In [21]:
ser3[0]

'a'

In [22]:
ser1 + ser2

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

In [23]:
from numpy.random import randn

In [24]:
np.random.seed(101)

In [25]:
df = pd.DataFrame(randn(5,4), ['A', 'B', 'C', 'D', 'E'], ['W', 'X', 'Y', 'Z'])

In [26]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [27]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [29]:
df[['W', 'Z']]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [33]:
df['new'] = df['W'] + df['Y']

In [34]:
df

          W         X         Y         Z       new
A  0.907969  0.628133  0.907969  0.503826  1.815939
B -0.848077 -0.319318 -0.848077  0.605965 -1.696154
C  0.528813  0.740122  0.528813 -0.589001  1.057627
D -0.933237 -0.758872 -0.933237  0.955057 -1.866474
E  2.605967  1.978757  2.605967  0.683509  5.211935

In [38]:
df.drop('new', axis=1, inplace=True)

In [39]:
df

          W         X         Y         Z
A  0.907969  0.628133  0.907969  0.503826
B -0.848077 -0.319318 -0.848077  0.605965
C  0.528813  0.740122  0.528813 -0.589001
D -0.933237 -0.758872 -0.933237  0.955057
E  2.605967  1.978757  2.605967  0.683509

In [41]:
df.drop('E')

          W         X         Y         Z
A  0.907969  0.628133  0.907969  0.503826
B -0.848077 -0.319318 -0.848077  0.605965
C  0.528813  0.740122  0.528813 -0.589001
D -0.933237 -0.758872 -0.933237  0.955057

In [42]:
df.shape

(5, 4)

In [45]:
type(df.loc['A'])

pandas.core.series.Series

In [46]:
df.iloc[0]

W    0.907969
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [48]:
df.iloc[2].equals(df.loc['C'])

True

In [49]:
df.loc['B', 'Y']

-0.8480769834036315

In [50]:
df

          W         X         Y         Z
A  0.907969  0.628133  0.907969  0.503826
B -0.848077 -0.319318 -0.848077  0.605965
C  0.528813  0.740122  0.528813 -0.589001
D -0.933237 -0.758872 -0.933237  0.955057
E  2.605967  1.978757  2.605967  0.683509

In [51]:
df.loc[['A','B'], ['X', 'Z']]

          X         Z
A  0.628133  0.503826
B -0.319318  0.605965

In [52]:
df > 0

       W      X      Y      Z
A   True   True   True   True
B  False  False  False   True
C   True   True   True  False
D  False  False  False   True
E   True   True   True   True

In [53]:
booldf = df > 0

In [54]:
booldf

       W      X      Y      Z
A   True   True   True   True
B  False  False  False   True
C   True   True   True  False
D  False  False  False   True
E   True   True   True   True

In [55]:

df[booldf]

          W         X         Y         Z
A  0.907969  0.628133  0.907969  0.503826
B       NaN       NaN       NaN  0.605965
C  0.528813  0.740122  0.528813       NaN
D       NaN       NaN       NaN  0.955057
E  2.605967  1.978757  2.605967  0.683509

In [56]:
df[df>0]

          W         X         Y         Z
A  0.907969  0.628133  0.907969  0.503826
B       NaN       NaN       NaN  0.605965
C  0.528813  0.740122  0.528813       NaN
D       NaN       NaN       NaN  0.955057
E  2.605967  1.978757  2.605967  0.683509

In [58]:
df[df['W']>0]

          W         X         Y         Z
A  0.907969  0.628133  0.907969  0.503826
C  0.528813  0.740122  0.528813 -0.589001
E  2.605967  1.978757  2.605967  0.683509

In [59]:
df

          W         X         Y         Z
A  0.907969  0.628133  0.907969  0.503826
B -0.848077 -0.319318 -0.848077  0.605965
C  0.528813  0.740122  0.528813 -0.589001
D -0.933237 -0.758872 -0.933237  0.955057
E  2.605967  1.978757  2.605967  0.683509

In [61]:
res = df[df['W']>0]

In [62]:
res

          W         X         Y         Z
A  0.907969  0.628133  0.907969  0.503826
C  0.528813  0.740122  0.528813 -0.589001
E  2.605967  1.978757  2.605967  0.683509

In [64]:
df[df['W']>0][['Y', 'X']]

          Y         X
A  0.907969  0.628133
C  0.528813  0.740122
E  2.605967  1.978757

In [68]:
df[(df['W']>0) | (df['Y']>1)]

          W         X         Y         Z
A  0.907969  0.628133  0.907969  0.503826
C  0.528813  0.740122  0.528813 -0.589001
E  2.605967  1.978757  2.605967  0.683509

In [69]:
df

          W         X         Y         Z
A  0.907969  0.628133  0.907969  0.503826
B -0.848077 -0.319318 -0.848077  0.605965
C  0.528813  0.740122  0.528813 -0.589001
D -0.933237 -0.758872 -0.933237  0.955057
E  2.605967  1.978757  2.605967  0.683509

In [72]:
df.reset_index(drop=True)

          W         X         Y         Z
0  0.907969  0.628133  0.907969  0.503826
1 -0.848077 -0.319318 -0.848077  0.605965
2  0.528813  0.740122  0.528813 -0.589001
3 -0.933237 -0.758872 -0.933237  0.955057
4  2.605967  1.978757  2.605967  0.683509

In [74]:
new_ind = 'CA NY WY OR CO'.split()

In [75]:
new_ind

['CA', 'NY', 'WY', 'OR', 'CO']

In [76]:
df['State'] = new_ind

In [77]:
df

          W         X         Y         Z State
A  0.907969  0.628133  0.907969  0.503826    CA
B -0.848077 -0.319318 -0.848077  0.605965    NY
C  0.528813  0.740122  0.528813 -0.589001    WY
D -0.933237 -0.758872 -0.933237  0.955057    OR
E  2.605967  1.978757  2.605967  0.683509    CO

In [78]:
df.set_index('State')

              W         X         Y         Z
State
CA     0.907969  0.628133  0.907969  0.503826
NY    -0.848077 -0.319318 -0.848077  0.605965
WY     0.528813  0.740122  0.528813 -0.589001
OR    -0.933237 -0.758872 -0.933237  0.955057
CO     2.605967  1.978757  2.605967  0.683509

In [79]:
outside = ['G1', 'G1', 'G1', 'G2', 'G2', 'G2']
inside = [1, 2, 3, 1, 2, 3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [80]:
hier_index

MultiIndex(levels=[['G1', 'G2'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]])

In [81]:
df = pd.DataFrame(randn(6,2), hier_index, ['A', 'B'])

In [82]:
df

             A         B
G1 1  0.302665  1.693723
   2 -1.706086 -1.159119
   3 -0.134841  0.390528
G2 1  0.166905  0.184502
   2  0.807706  0.072960
   3  0.638787  0.329646

In [86]:
df.index.names = ['Groups', 'Num']

In [87]:
df

                   A         B
Groups Num
G1     1    0.302665  1.693723
       2   -1.706086 -1.159119
       3   -0.134841  0.390528
G2     1    0.166905  0.184502
       2    0.807706  0.072960
       3    0.638787  0.329646

In [89]:
df.loc['G2'].loc[2, 'B']

0.07295967531703869

In [91]:
df

                   A         B
Groups Num
G1     1    0.302665  1.693723
       2   -1.706086 -1.159119
       3   -0.134841  0.390528
G2     1    0.166905  0.184502
       2    0.807706  0.072960
       3    0.638787  0.329646

In [92]:
df.xs('G1')

            A         B
Num
1    0.302665  1.693723
2   -1.706086 -1.159119
3   -0.134841  0.390528

In [93]:
df.xs(1, level='Num')

               A         B
Groups
G1      0.302665  1.693723
G2      0.166905  0.184502

In [94]:
d = {'A':[1, 2, np.nan] , 'B':[5, np.nan, np.nan], 'C':[1,2,3]}
df = pd.DataFrame(d)

In [95]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [98]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [99]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [100]:
df.dropna(thresh=3)

     A    B  C
0  1.0  5.0  1

In [102]:
df.dropna(thresh=1)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [103]:
df.fillna(value='Fill Value')

            A           B  C
0           1           5  1
1           2  Fill Value  2
2  Fill Value  Fill Value  3

In [104]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [105]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [106]:
df = pd.DataFrame(data)

In [107]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [109]:
byComp = df.groupby('Company')

In [110]:
byComp.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [112]:
byComp.std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [113]:
byComp.sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [114]:
df.groupby('Company').sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [116]:
df.groupby('Company').max()

          Person  Sales
Company
FB         Sarah    350
GOOG         Sam    200
MSFT     Vanessa    340

In [121]:
df.groupby('Company').describe().stack()

                    Sales
Company
FB      count    2.000000
        mean   296.500000
        std     75.660426
        min    243.000000
        25%    269.750000
        50%    296.500000
        75%    323.250000
        max    350.000000
GOOG    count    2.000000
        mean   160.000000
        std     56.568542
        min    120.000000
        25%    140.000000
        50%    160.000000
        75%    180.000000
        max    200.000000
MSFT    count    2.000000
        mean   232.000000
        std    152.735065
        min    124.000000
        25%    178.000000
        50%    232.000000
        75%    286.000000
        max    340.000000

In [122]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7]) 
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

In [124]:
pd.concat([df1, df2, df3], axis=1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [125]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

In [127]:
left

    A   B key
0  A0  B0  K0
1  A1  B1  K1
2  A2  B2  K2
3  A3  B3  K3

In [128]:
pd.merge(left, right, how='left', on='key')

    A   B key   C   D
0  A0  B0  K0  C0  D0
1  A1  B1  K1  C1  D1
2  A2  B2  K2  C2  D2
3  A3  B3  K3  C3  D3

In [129]:
left.join(right)

ValueError: columns overlap but no suffix specified: Index(['key'], dtype='object')

In [130]:
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [131]:
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [132]:
left

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [133]:
right

     C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3

In [134]:
left.join(right, how='outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

In [135]:
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})

In [136]:
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [138]:
df['col2'].nunique()

3

In [139]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [140]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [142]:
df[(df['col1']>2) & (df['col2'] == 444)]

   col1  col2 col3
3     4   444  xyz

In [143]:
def time2(x):
    return x*2

In [145]:
df['col1'].apply(time2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [146]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [147]:
df['col2'].apply(lambda x: x*2)

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

In [148]:
df.drop('col1', axis=1)

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [151]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [152]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [153]:
df.sort_values(by='col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [154]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [155]:
df = pd.DataFrame({'col1':[1,2,3,np.nan],
                   'col2':[np.nan,555,666,444],
                   'col3':['abc','def','ghi','xyz']})
df.head()

   col1   col2 col3
0   1.0    NaN  abc
1   2.0  555.0  def
2   3.0  666.0  ghi
3   NaN  444.0  xyz

In [156]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

In [157]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [158]:
df.pivot_table(values='D', index=['A', 'B'], columns=['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

In [159]:
pwd

'/Users/hyungwon/Dropbox/Computer Science/MachineLearningUdemy/Python-Data-Science-and-Machine-Learning-Bootcamp/Python-for-Data-Analysis/Pandas'

In [161]:
pd.read_csv('example')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [162]:
df = pd.read_csv('example')

In [163]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [164]:

df.to_csv('example.csv', index=False)

In [165]:
pd.read_csv('example.csv')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [167]:
data = pd.read_html('http://www.fdic.gov/bank/individual/failed/banklist.html')

In [168]:
type(data)

list

In [171]:
data[0].head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Washington Federal Bank for Savings,Chicago,IL,30570,Royal Savings Bank,"December 15, 2017","February 1, 2019"
1,The Farmers and Merchants State Bank of Argonia,Argonia,KS,17719,Conway Bank,"October 13, 2017","February 21, 2018"
2,Fayette County Bank,Saint Elmo,IL,1802,"United Fidelity Bank, fsb","May 26, 2017","January 29, 2019"
3,"Guaranty Bank, (d/b/a BestBank in Georgia & Mi...",Milwaukee,WI,30003,First-Citizens Bank & Trust Company,"May 5, 2017","March 22, 2018"
4,First NBC Bank,New Orleans,LA,58302,Whitney Bank,"April 28, 2017","January 29, 2019"